config/InformationRegisters/ККМ_ПользователиКассиры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ККМ_ПользователиКассиры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аптека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/CommonModules/ОМ41_ФормыДокументов/Ext/Module.bsl
//============================================================================ GtG ===
Процедура ОМ41_ПередОткрытиемДокумента  (Док,Форма,Отказ) Экспорт
	// Назначение:
	// Стандартные действия  при Перед Открытием любого документа
	// 
	// 
	//--------------------------------------------------------------------------------
	//Сообщить("ОМ41_ПередОткрытиемДокумента "+Док+"  "+Форма);
	
	// Возможно только в толстом клиенте!!!
	#Если Клиент ТОгда
		
		
		
		//ДЗР=Константы.ДатаЗапретаРедактирования.Получить();
		//Если док.ЭтоНовый()=Истина Тогда
		//	дд=РабочаяДата; // дата документа еще не установлена
		//	
		//	Если ДД<=ДЗР тогда
		//		
		//		Предупреждение("Дата документа меньше даты запрета редактирования!
		//		|Нельзя вводить новые документы Ранее даты "+ Константы.ДатаЗапретаРедактирования.Получить());
		//		Отказ=Истина;
		//	КонецЕсли; 
		//Иначе // Это не новый документ
		//	Если Док.Дата<= ДЗР Тогда
		//		Форма.ТолькоПросмотр=Истина;
		//		
		//		Предупреждение("Дата документа меньше даты запрета редактирования!
		//		|Нельзя редактировать документы Ранее даты "+ Константы.ДатаЗапретаРедактирования.Получить());
		//		
		//	КонецЕсли; 	
		//КонецЕсли; 	
		
	#КонецЕсли 
	
	
КонецПроцедуры
 //============================================================================ GtG ===
 
 
 //============================================================================ Virus ===
Процедура ОМ41_ПередУдалениемДокумента  (Док,Отказ) Экспорт
	 
	ДЗР=Константы.ДатаЗапретаРедактирования.Получить();
	Если Док.Проведен = Истина Тогда
		Если Док.Дата <= ДЗР Тогда
			#Если Клиент ТОгда
			Предупреждение("Дата документа меньше даты запрета редактирования!
			|Нельзя распроводить\удалять документы ранее даты "+ ДЗР );
			#КонецЕсли
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры
//============================================================================ Virus === 

Функция ОМ41_СкладИФирмаТекущегоПользователя() Экспорт
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ККМ_ПользователиКассиры.Фирма,
	                    |	ККМ_ПользователиКассиры.Аптека
	                    |ИЗ
	                    |	РегистрСведений.ККМ_ПользователиКассиры КАК ККМ_ПользователиКассиры
	                    |ГДЕ
	                    |	ККМ_ПользователиКассиры.Пользователь = &Пользователь");
						
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийСотр);
	
	Рез=Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество()=0 Тогда
		Возврат Новый Структура("Фирма,Аптека",Неопределено,Неопределено);
	Иначе
		Стр=Рез.Получить(0);
		Возврат	Новый Структура("Фирма,Аптека",Стр.Фирма,Стр.Аптека);
	КонецЕсли;	
	
	
КонецФункции
